from odoo import api, fields, models


class AccountWithholdingLine(models.AbstractModel):
    _inherit = "account.withholding.line"

    @api.model
    def _get_tax_section(self):
        return [
            ("1", "1. เงินเดือน ค่าจ้าง ฯลฯ 40(1)"),
            ("2", "2. ค่าธรรมเนียม ค่านายหน้า ฯลฯ 40(2)"),
            ("3", "3. ค่าแห่งลิขสิทธิ์ ฯลฯ 40(3)"),
            ("4", "4. ดอกเบี้ย ฯลฯ 40(4)ก"),
            (
                "411",
                "4. เงินปันผล เงินส่วนแบ่งกำไร ฯลฯ 40(4)ข (1.1) "
                "กิจการที่ต้องเสียภาษีเงินได้นิติบุคคลร้อยละ 30 ของกำไรสุทธิ",
            ),
            (
                "412",
                "4. เงินปันผล เงินส่วนแบ่งกำไร ฯลฯ 40(4)ข (1.2) "
                "กิจการที่ต้องเสียภาษีเงินได้นิติบุคคลร้อยละ 25 ของกำไรสุทธิ",
            ),
            (
                "413",
                "4. เงินปันผล เงินส่วนแบ่งกำไร ฯลฯ 40(4)ข (1.3) "
                "กิจการที่ต้องเสียภาษีเงินได้นิติบุคคลร้อยละ 20 ของกำไรสุทธิ",
            ),
            (
                "414",
                "4. เงินปันผล เงินส่วนแบ่งกำไร ฯลฯ 40(4)ข (1.4) "
                "กิจการที่ต้องเสียภาษีเงินได้นิติบุคคลร้อยละ อื่นๆ (ระบุ) ของกำไรสุทธิ",
            ),
            (
                "421",
                "4. เงินปันผล เงินส่วนแบ่งกำไร ฯลฯ 40(4)ข (2.1) "
                "กำไรสุทธิกิจการที่ได้รับยกเว้นภาษีเงินได้นิติบุคคล",
            ),
            (
                "422",
                "4. เงินปันผล เงินส่วนแบ่งกำไร ฯลฯ 40(4)ข (2.2) "
                "ได้รับยกเว้นไม่ต้องนำมารวมคำนวณเป็นรายได้",
            ),
            (
                "423",
                "4. เงินปันผล เงินส่วนแบ่งกำไร ฯลฯ 40(4)ข (2.3) "
                "กำไรสุทธิส่วนที่หักผลขาดทุนสุทธิยกมาไม่เกิน 5 ปี",
            ),
            (
                "424",
                "4. เงินปันผล เงินส่วนแบ่งกำไร ฯลฯ 40(4)ข (2.4) กำไรที่รับรู้ทางบัญชีโดยวิธีส่วนได้เสีย",
            ),
            ("425", "4. เงินปันผล เงินส่วนแบ่งกำไร ฯลฯ 40(4)ข (2.5) อื่นๆ (ระบุ)"),
            ("5", "5. ค่าจ้างทำของ ค่าบริการ ค่าเช่า ค่าขนส่ง ฯลฯ 3 เตรส"),
            ("6", "6. อื่นๆ (ระบุ)"),
        ]

    tax_section = fields.Selection(
        selection=_get_tax_section,
        default=False,
        copy=False,
    )
    other = fields.Char(
        copy=False,
    )
